# pip install pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

In [3]:
pd.Series([10, 20, 30])

0    10
1    20
2    30
dtype: int64

In [9]:
array = np.array([10, 20, 30])
pd.Series(array)

0    10
1    20
2    30
dtype: int64

In [4]:
array = np.array([10, 20, 30])
serie = pd.Series(array)
serie.dtype, type(serie)

(dtype('int64'), pandas.core.series.Series)

In [5]:
serie[0]

np.int64(10)

In [13]:
serie[0:2]

0    10
1    20
dtype: int64

In [15]:
array = np.array(["alb", "negru", "rosu"])
serie = pd.Series(array)
serie

0      alb
1    negru
2     rosu
dtype: object

In [ ]:
array = np.array(["alb", "negru", "rosu"])
pd.DataFrame(array)

       0
0    alb
1  negru
2   rosu

In [17]:
array = np.array(["alb", "negru", "rosu"])
df = pd.DataFrame(array)
df

       0
0    alb
1  negru
2   rosu

In [18]:
array = np.array([["alb", "negru", "rosu"], [11, 22, 33]])
df = pd.DataFrame(array)
df

     0      1     2
0  alb  negru  rosu
1   11     22    33

In [9]:
df = pd.DataFrame(
    {
       "culori": ["alb", "negru", "rosu", "verde"], 
       "valori": [11, 22, 33, None]
    }
)
df

  culori  valori
0    alb    11.0
1  negru    22.0
2   rosu    33.0
3  verde     NaN

In [ ]:
df = pd.DataFrame(
    {
       "culori": ["alb", "negru", "rosu", "verde", "mov", "blue", "galben"], 
       "valori": [11, 22, 33, 44, 55, 66., 77]
    }
)
df

   culori  valori
0     alb    11.0
1   negru    22.0
2    rosu    33.0
3   verde    44.0
4     mov    55.0
5    blue    66.0
6  galben    77.0

In [11]:
df.dtypes

culori     object
valori    float64
dtype: object

In [12]:
type(df["culori"])

pandas.core.series.Series

In [14]:
df[ ["culori", "valori"]  ]

   culori  valori
0     alb    11.0
1   negru    22.0
2    rosu    33.0
3   verde    44.0
4     mov    55.0
5    blue    66.0
6  galben    77.0

In [26]:
df.head()

  culori  valori
0    alb      11
1  negru      22
2   rosu      33
3  verde      44
4    mov      55

In [27]:
df.head(2)

  culori  valori
0    alb      11
1  negru      22

In [28]:
df.tail()

   culori  valori
2    rosu      33
3   verde      44
4     mov      55
5    blue      66
6  galben      77

In [15]:
df.tail(2)

   culori  valori
5    blue    66.0
6  galben    77.0

In [30]:
df.describe()

          valori
count   7.000000
mean   44.000000
std    23.762716
min    11.000000
25%    27.500000
50%    44.000000
75%    60.500000
max    77.000000

In [16]:
df.to_csv("culori.csv")